/*
 * 练习1.8
 * 指出下列那些输出语句是合法的（如果有的话）：
 */
// std::cout << "/*";
// std::cout << "*/";
// std::cout << /* "*/" */;
// std::cout << /* "*/" /* "/*" */;
/*
 * 预测编译这些语句会产生什么样的后果，实际编译这些语句来验证你的答案。
 */

// std::cout << "/*";
// 推测：合法
// 编译：合法

// std::cout << "*/";
// 推测：合法
// 编译：合法

// std::cout << /* "*/" */;
// 推测：不合法，/* "*/内为注释，" */被认为是源码
// 编译：不合法，" */的引号后所有内容被认为是字符串

// std::cout << /* "*/" /* "/*" */;
// 推测：不合法，/* "*/为注释，" /* "为字符串，/*" */为注释
// 编译：合法，/* "*/为注释，" /* "为字符串，/*" */为注释，打印字符串

#include <iostream>
int main(){
    std::cout << /* "*/" /* "/*" */;
    return 0;
}